perf/results/multinode/breakpoint/cfg-breakpoint-heavy.yaml
config:
  environments:
    heavy:
      target: 'http://localhost:5555/node/heavy'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Slow Ramp # used by slow endpoints
      duration: 300   # seconds
      arrivalRate: 1
      rampTo: 20
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'