perf/results/multinode/breakpoint/cfg-breakpoint-ping.yaml
config:
  environments:
    ping:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp # used by slow endpoints
      duration: 250   # seconds
      arrivalRate: 10
      rampTo: 1000
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'